src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Автор</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПеремещениеТоваров/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль объекта
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик события Перед записью.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСвязкуСкладов(Отказ);
		
КонецПроцедуры

// Обработчик события Обработка проведения.
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Создание сгруппированного списка товаров.
	СписокТоваров = Товары.Выгрузить();
	СписокТоваров.Свернуть("Товар", "Количество");
	
	ЗаписатьДвиженияВОстаткиТоваров(СписокТоваров);
	
	Если Не ДополнительныеСвойства.Свойство("ПроведениеБезКонтроляОстатков") Тогда
		ПроверяемыеТовары = СписокТоваров.ВыгрузитьКолонку("Товар");
		ЗапасыСервер.ПроконтролироватьОстаткиТоваров(ПроверяемыеТовары, СкладОтправитель, МоментВремени(), Отказ);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет отличие склада отправителя от склада получателя.
//
// Параметры:
//  Отказ - Булево 
//
Процедура ПроверитьСвязкуСкладов(Отказ)
	
	Если СкладОтправитель = СкладПолучатель Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Склад отправитель должен отличаться от склада получателя'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
	
КонецПроцедуры

// Записывает движения документа в регистр накопления Остатки товаров.
//
// Параметры:
//  СписокТоваров - ТаблицаЗначений - таблица товаров. 
//
Процедура ЗаписатьДвиженияВОстаткиТоваров(СписокТоваров)
	
	Движения.ОстаткиТоваров.Записывать 				= Истина;
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	
	Для Каждого СтрокаТоваров Из СписокТоваров Цикл
		Товар 		= СтрокаТоваров.Товар;
		Количество 	= СтрокаТоваров.Количество;
		
		// Списание со склада отправителя.
		Движение 			= Движения.ОстаткиТоваров.ДобавитьРасход();
		Движение.Период 	= Дата;
		Движение.Склад 		= СкладОтправитель;
		Движение.Товар 		= Товар;
		Движение.Количество = Количество;
		
		// Поступление на склад получатель.
		Движение 			= Движения.ОстаткиТоваров.ДобавитьПриход();
		Движение.Период 	= Дата;
		Движение.Склад 		= СкладПолучатель;
		Движение.Товар 		= Товар;
		Движение.Количество = Количество;
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти
